SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_gpio.c
    /* PLOCKK write 0 */
    GPIOx->PLOCK = pin; 
    
    /* PLOCKK and PLOCKx write 1 */
    GPIOx->PLOCK = temp_value; 

    /* PLOCKK read 0 */
    temp_value = GPIOx->PLOCK;
    
    /* PLOCKK read 1 */
    temp_value = GPIOx->PLOCK;
}


/**
 *\*\name   GPIO_Pin_Remap_Set.
 *\*\fun    Pin remapping configuration.
 *\*\param  port_source :
 *\*\          - GPIOA_PORT_SOURCE
 *\*\          - GPIOB_PORT_SOURCE
 *\*\          - GPIOC_PORT_SOURCE
 *\*\          - GPIOD_PORT_SOURCE
 *\*\param  pin_source :
 *\*\          - GPIO_PIN_SOURCE0
 *\*\          - GPIO_PIN_SOURCE1
 *\*\          - GPIO_PIN_SOURCE2
 *\*\          - GPIO_PIN_SOURCE3
 *\*\          - GPIO_PIN_SOURCE4
 *\*\          - GPIO_PIN_SOURCE5
 *\*\          - GPIO_PIN_SOURCE6
 *\*\          - GPIO_PIN_SOURCE7
 *\*\          - GPIO_PIN_SOURCE8
 *\*\          - GPIO_PIN_SOURCE9
 *\*\          - GPIO_PIN_SOURCE10
 *\*\          - GPIO_PIN_SOURCE11
 *\*\          - GPIO_PIN_SOURCE12
 *\*\          - GPIO_PIN_SOURCE13
 *\*\          - GPIO_PIN_SOURCE14
 *\*\          - GPIO_PIN_SOURCE15
 *\*\param  alternate_function :
 *\*\          - GPIO_AF0_SWDIO_JTMS   SWDIO Alternate Function mapping   
 *\*\          - GPIO_AF0_SWCLK_JTCK   SWCLK Alternate Function mapping   
 *\*\          - GPIO_AF0_JTDI         JTDI  Alternate Function mapping   
 *\*\          - GPIO_AF0_JTDO         JTDO  Alternate Function mapping   
 *\*\          - GPIO_AF0_NJRST        NJRST Alternate Function mapping   
 *\*\
 *\*\          - GPIO_AF1_SPI1         SPI1 Alternate Function mapping    
 *\*\          - GPIO_AF1_SPI2         SPI2 Alternate Function mapping    
 *\*\          - GPIO_AF1_TIM8         TIM8 Alternate Function mapping    
 *\*\          - GPIO_AF1_USART1       USART1 Alternate Function mapping  
 *\*\
 *\*\          - GPIO_AF2_TIM5         TIM5 Alternate Function mapping    
 *\*\          - GPIO_AF2_TIM1         TIM1 Alternate Function mapping    
 *\*\          - GPIO_AF2_USART1       USART1 Alternate Function mapping  
 *\*\          - GPIO_AF2_I2C2         I2C2 Alternate Function mapping    
 *\*\          - GPIO_AF2_CAN          CAN Alternate Function mapping     
 *\*\          - GPIO_AF2_CAN1         CAN1 Alternate Function mapping    
 *\*\          - GPIO_AF2_SPI2         SPI2 Alternate Function mapping    
 *\*\          - GPIO_AF2_SPI1         SPI1 Alternate Function mapping    
 *\*\          - GPIO_AF2_I2C1         I2C1 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF3_TIM2         TIM2 Alternate Function mapping    
 *\*\          - GPIO_AF3_SPI2         SPI2 Alternate Function mapping    
 *\*\          - GPIO_AF3_TIM3         TIM3 Alternate Function mapping    
 *\*\          - GPIO_AF3_TIM1         TIM1 Alternate Function mapping    
 *\*\          - GPIO_AF3_LPTIM        LPTIM Alternate Function mapping   
 *\*\          - GPIO_AF3_TIM4         TIM4 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF4_EVENTOUT     EVENTOUT Alternate Function mapping
 *\*\          - GPIO_AF4_USART2       USART2 Alternate Function mapping  
 *\*\
 *\*\          - GPIO_AF5_USART2       USART2 Alternate Function mapping  
 *\*\          - GPIO_AF5_USART1       USART1 Alternate Function mapping  
 *\*\          - GPIO_AF5_SPI1         SPI1 Alternate Function mapping    
 *\*\          - GPIO_AF5_TIM3         TIM3 Alternate Function mapping    
 *\*\          - GPIO_AF5_SPI2         SPI2 Alternate Function mapping    
 *\*\          - GPIO_AF5_I2C1         I2C1 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF6_TIM2         TIM2 Alternate Function mapping    
 *\*\          - GPIO_AF6_I2C2         I2C2 Alternate Function mapping    
 *\*\          - GPIO_AF6_TIM4         TIM4 Alternate Function mapping    
 *\*\          - GPIO_AF6_TIM1         TIM1 Alternate Function mapping    
 *\*\          - GPIO_AF6_SPI1         SPI1 Alternate Function mapping    
 *\*\          - GPIO_AF6_SPI2         SPI2 Alternate Function mapping    
 *\*\          - GPIO_AF6_LPTIM        LPTIM Alternate Function mapping   
 *\*\          - GPIO_AF6_CAN          CAN Alternate Function mapping     
 *\*\          - GPIO_AF6_UART4        UART4 Alternate Function mapping     
 *\*\
 *\*\          - GPIO_AF7_TIM5         TIM5 Alternate Function mapping     
 *\*\          - GPIO_AF7_TIM8         TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF7_I2C2         I2C2 Alternate Function mapping     
 *\*\          - GPIO_AF7_USART2       USART2 Alternate Function mapping   
 *\*\          - GPIO_AF7_UART4        UART4 Alternate Function mapping    
 *\*\          - GPIO_AF7_UART3        UART3 Alternate Function mapping    
 *\*\          - GPIO_AF7_TIM1         TIM1 Alternate Function mapping     
 *\*\          - GPIO_AF7_I2C1         I2C1 Alternate Function mapping     
 *\*\
 *\*\          - GPIO_AF8_TIM8         TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF8_TIM5         TIM5 Alternate Function mapping     
 *\*\          - GPIO_AF8_COMP2        COMP2 Alternate Function mapping    
 *\*\          - GPIO_AF8_I2C1         I2C1 Alternate Function mapping     
 *\*\          - GPIO_AF8_TIM1         TIM1 Alternate Function mapping     
 *\*\          - GPIO_AF8_COMP1        COMP1 Alternate Function mapping    
 *\*\          - GPIO_AF8_UART3        UART3 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF9_COMP1        COMP1 Alternate Function mapping    
 *\*\          - GPIO_AF9_TIM8         TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF9_TIM4         TIM4 Alternate Function mapping     
 *\*\          - GPIO_AF9_MCO          MCO Alternate Function mapping      
 *\*\          - GPIO_AF9_RTC          RTC Alternate Function mapping      
 *\*\          - GPIO_AF9_COMP2        COMP2 Alternate Function mapping    
 *\*\          - GPIO_AF9_LPTIM        LPTIM Alternate Function mapping    
 *\*\          - GPIO_AF9_I2C2         I2C2 Alternate Function mapping     
 *\*\          - GPIO_AF9_TIMESTAMP    TIMESTAMP Alternate Function mapping 
 *\*\
 *\*\          - GPIO_AF10_TIM1        TIM1 Alternate Function mapping     
 *\*\          - GPIO_AF10_TIM8        TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF10_COMP3       COMP3 Alternate Function mapping    
 *\*\          - GPIO_AF10_TIM4        TIM4 Alternate Function mapping     
 *\*\          - GPIO_AF10_COMP1       COMP1 Alternate Function mapping    
 *\*\          - GPIO_AF10_UART3       UART3 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF11_UART4       UART4 Alternate Function mapping    
 *\*\          - GPIO_AF11_CAN         CAN Alternate Function mapping      
 *\*\          - GPIO_AF11_USART2      USART2 Alternate Function mapping   
 *\*\          - GPIO_AF11_TIM8        TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF11_COMP3       COMP3 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF12_LPTIM       LPTIM Alternate Function mapping    
 *\*\          - GPIO_AF12_BEEPER      BEEPER Alternate Function mapping   
 *\*\
 *\*\          - GPIO_AF13_TIM3        TIM3 Alternate Function mapping     
 *\*\          - GPIO_AF13_TIM8        TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF13_TIM4        TIM4 Alternate Function mapping     
 *\*\          - GPIO_AF13_TIM5        TIM5 Alternate Function mapping     
 *\*\return none
 */
void GPIO_Pin_Remap_Set(uint8_t port_source, uint8_t pin_source, uint32_t alternate_function)
{
    uint32_t position = 0x00, temp_value = 0x00;
    GPIO_Module *GPIOx;

    /* Get Peripheral index */
    GPIOx = GPIO_GET_PERIPH(port_source);

    if(pin_source & (uint8_t)AF_SELECTION_MASK)
    {
        position = (uint32_t)(pin_source & (uint8_t)AF_WRITE_POSITION_MASK);

