SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_gpio.c
        /* Read GPIO_AFH register */
        temp_value = GPIOx->AFH;

        /* Reset corresponding bits */
        temp_value &= ~(GPIO_AF_MASK << (position * MULTIPLIER_FACTOR_4));

        /* Set corresponding bits */
        temp_value |= (alternate_function << (position * MULTIPLIER_FACTOR_4));

        /* Write to the GPIO_AFH register */
        GPIOx->AFH = temp_value;
    }
    else
    {
        position = (uint32_t)(pin_source & (uint8_t)AF_WRITE_POSITION_MASK);

        /* Read GPIO_AFL register */
        temp_value  = GPIOx->AFL;

        /* Reset corresponding bits */
        temp_value &= ~(GPIO_AF_MASK << (position * MULTIPLIER_FACTOR_4)); 

        /* Set corresponding bits */
        temp_value |= (alternate_function << (position * MULTIPLIER_FACTOR_4));

        /* Write to the GPIO_AFL register */
        GPIOx->AFL = temp_value;
    }
}

/**
 *\*\name   GPIO_EXTI_Line_Set.
 *\*\fun    Selects the GPIO pin used as EXTI Line.
 *\*\param  EXTI_line :
 *\*\          - EXTI_LINE_SOURCE0
 *\*\          - EXTI_LINE_SOURCE1
 *\*\          - EXTI_LINE_SOURCE2
 *\*\          - EXTI_LINE_SOURCE3
 *\*\          - EXTI_LINE_SOURCE4
 *\*\          - EXTI_LINE_SOURCE5
 *\*\          - EXTI_LINE_SOURCE6
 *\*\          - EXTI_LINE_SOURCE7
 *\*\          - EXTI_LINE_SOURCE8
 *\*\          - EXTI_LINE_SOURCE9
 *\*\          - EXTI_LINE_SOURCE10
 *\*\          - EXTI_LINE_SOURCE11
 *\*\          - EXTI_LINE_SOURCE12
 *\*\          - EXTI_LINE_SOURCE13
 *\*\          - EXTI_LINE_SOURCE14
 *\*\          - EXTI_LINE_SOURCE15
 *\*\param  pin_source :
 *\*\          - AFIO_EXTI_PA0
 *\*\          - AFIO_EXTI_PB0
 *\*\          - AFIO_EXTI_PD0
 *\*\          - AFIO_EXTI_PA1
 *\*\          - AFIO_EXTI_PB1
 *\*\          - AFIO_EXTI_PA2
 *\*\          - AFIO_EXTI_PB2
 *\*\          - AFIO_EXTI_PA3
 *\*\          - AFIO_EXTI_PB3
 *\*\          - AFIO_EXTI_PA4
 *\*\          - AFIO_EXTI_PB4
 *\*\          - AFIO_EXTI_PA5
 *\*\          - AFIO_EXTI_PB5
 *\*\          - AFIO_EXTI_PA6
 *\*\          - AFIO_EXTI_PB6
 *\*\          - AFIO_EXTI_PA7
 *\*\          - AFIO_EXTI_PB7
 *\*\          - AFIO_EXTI_PA8
 *\*\          - AFIO_EXTI_PB8
 *\*\          - AFIO_EXTI_PA9
 *\*\          - AFIO_EXTI_PB9
 *\*\          - AFIO_EXTI_PA10
 *\*\          - AFIO_EXTI_PB10
 *\*\          - AFIO_EXTI_PA11
 *\*\          - AFIO_EXTI_PB11
 *\*\          - AFIO_EXTI_PA12
 *\*\          - AFIO_EXTI_PB12
 *\*\          - AFIO_EXTI_PD12
 *\*\          - AFIO_EXTI_PA13
 *\*\          - AFIO_EXTI_PB13
 *\*\          - AFIO_EXTI_PC13
 *\*\          - AFIO_EXTI_PD13
 *\*\          - AFIO_EXTI_PA14
 *\*\          - AFIO_EXTI_PB14
 *\*\          - AFIO_EXTI_PC14
 *\*\          - AFIO_EXTI_PD14
 *\*\          - AFIO_EXTI_PA15
 *\*\          - AFIO_EXTI_PB15
 *\*\          - AFIO_EXTI_PC15
 *\*\          - AFIO_EXTI_PD15
 *\*\return none
 */
void GPIO_EXTI_Line_Set(uint8_t EXTI_line, uint32_t pin_source)
{
    AFIO->EXTI_CFG[(EXTI_line >> SHIFT_EXTI)] &= ~(AFIO_EXTI_CFG_MASK << ((uint32_t)((EXTI_line & (uint8_t)AFIO_EXTI_POSITION_MASK) * MULTIPLIER_FACTOR_8)));
    AFIO->EXTI_CFG[(EXTI_line >> SHIFT_EXTI)] |=  (pin_source << ((uint32_t)((EXTI_line & (uint8_t)AFIO_EXTI_POSITION_MASK) * MULTIPLIER_FACTOR_8)));
}


/**
 *\*\name   AFIO_SPI_NSS_Mode_Set.
 *\*\fun    Selects the alternate function SPIx NSS mode.
 *\*\param  AFIO_SPIx_NSS : 
 *\*\          choose which SPI configuration.
 *\*\          - AFIO_SPI1_NSS
 *\*\          - AFIO_SPI2_NSS
 *\*\param  SPI_nss_mode : 
 *\*\          specifies the SPI_NSS mode to be configured.
 *\*\          - AFIO_SPI_NSS_HIGH_IMPEDANCE
 *\*\          - AFIO_SPI_NSS_High_LEVEL
 *\*\return none
 */
void AFIO_SPI_NSS_Mode_Set(uint32_t AFIO_SPIx_NSS, uint32_t SPI_NSS_mode)
{
    uint32_t temp_value = 0x00U;

    temp_value = (AFIO->RMP_CFG & AFIO_RMP_CFG_MASK);

    if(SPI_NSS_mode != AFIO_SPI_NSS_HIGH_IMPEDANCE)
    {
        temp_value |= AFIO_SPIx_NSS;
    }
    else
    {
        temp_value &= ~AFIO_SPIx_NSS;
    }

    AFIO->RMP_CFG = temp_value;
}


/**
 *\*\name   AFIO_ADC_External_Trigger_Remap_Set.
 *\*\fun    Configurate ADC external trigger.
 *\*\param  ADC_ETR_type : 
 *\*\          choose whether to configure rule conversion or injection conversion.
 *\*\          - AFIO_ADC_ETRI
 *\*\          - AFIO_ADC_ETRR
 *\*\param  ADC_trigger_remap : 
 *\*\          specifies the external trigger line be configured.
 *\*\          - AFIO_ADC_TRIG_EXTI_0
 *\*\          - AFIO_ADC_TRIG_EXTI_1
 *\*\          - AFIO_ADC_TRIG_EXTI_2
 *\*\          - AFIO_ADC_TRIG_EXTI_3
 *\*\          - AFIO_ADC_TRIG_EXTI_4
 *\*\          - AFIO_ADC_TRIG_EXTI_5
 *\*\          - AFIO_ADC_TRIG_EXTI_6
 *\*\          - AFIO_ADC_TRIG_EXTI_7
 *\*\          - AFIO_ADC_TRIG_EXTI_8
 *\*\          - AFIO_ADC_TRIG_EXTI_9
 *\*\          - AFIO_ADC_TRIG_EXTI_10
 *\*\          - AFIO_ADC_TRIG_EXTI_11
 *\*\          - AFIO_ADC_TRIG_EXTI_12
 *\*\          - AFIO_ADC_TRIG_EXTI_13
 *\*\          - AFIO_ADC_TRIG_EXTI_14
 *\*\          - AFIO_ADC_TRIG_EXTI_15
 *\*\          - AFIO_ADC_TRIG_TIM8_TRGO
 *\*\          - AFIO_ADC_TRIG_TIM8_CH4
 *\*\return none
 */
void AFIO_ADC_External_Trigger_Remap_Set(AFIO_ADC_ETRType ADC_ETR_type, AFIO_ADC_Trig_RemapType ADC_trigger_remap)
{
    uint32_t temp_value = 0x00U;

    if(ADC_ETR_type == AFIO_ADC_ETRI)
    {
        temp_value = AFIO->RMP_CFG;

        /* clear AFIO_RMP_CFG register ETRI bit */
        temp_value &= (~(AFIO_RMPCFG_ADC_MASK << AFIO_ADC_ETRI));

        /* if ADC_ETR_type is AFIO_ADC_ETRI then ADC_trigger_remap cannot be AFIO_ADC_TRIG_TIM8_TRGO */
        if(ADC_trigger_remap == AFIO_ADC_TRIG_TIM8_CH4)
        {
            /* select TIM8_CH4 line to connect */
            temp_value |= (AFIO_RMPCFG_ADC_MASK << AFIO_ADC_ETRI);
        }
        else
        {
            /* select which external line is connected */
            temp_value &= (~(AFIO_RMPCFG_EXTI_MASK << SHIFT_EXTI_ETRI));
            temp_value |= (ADC_trigger_remap << SHIFT_EXTI_ETRI);
        }
        AFIO->RMP_CFG = temp_value;
    }
    else if(ADC_ETR_type == AFIO_ADC_ETRR)
    {
        temp_value  = AFIO->RMP_CFG;

        /* clear AFIO_RMP_CFG register ETRR bit */
        temp_value &= (~(AFIO_RMPCFG_ADC_MASK << AFIO_ADC_ETRR));

        /* if ADC_ETR_type is AFIO_ADC_ETRR then ADC_trigger_remap cannot be AFIO_ADC_TRIG_TIM8_CH4 */
        if(ADC_trigger_remap == AFIO_ADC_TRIG_TIM8_TRGO)
        {
            /* select TIM8_TRGO line to connect */
            temp_value |= (AFIO_RMPCFG_ADC_MASK << AFIO_ADC_ETRR);
        }
        else
        {
            /* select which external line is connected */
            temp_value &= ~AFIO_RMPCFG_EXTI_MASK;
            temp_value |= ADC_trigger_remap;
        }
        AFIO->RMP_CFG = temp_value;
    }
}


/**
 *\*\name   AFIO_5V_Tolerance_Enable.
 *\*\fun    Enables 5V tolerance of GPIOA and GPIOB.
 *\*\param  tolerance_pin : 
 *\*\          - PA0_5V_TOLERANCE         
 *\*\          - PA1_5V_TOLERANCE         
 *\*\          - PA2_5V_TOLERANCE        
 *\*\          - PA3_5V_TOLERANCE         
 *\*\          - PA4_5V_TOLERANCE         
 *\*\          - PA5_5V_TOLERANCE         
 *\*\          - PA6_5V_TOLERANCE         
 *\*\          - PA7_5V_TOLERANCE        
 *\*\          - PA8_5V_TOLERANCE         
 *\*\          - PA11_5V_TOLERANCE        
 *\*\          - PA12_5V_TOLERANCE        
 *\*\          - PA15_5V_TOLERANCE        
 *\*\          - PB0_5V_TOLERANCE         
 *\*\          - PB1_5V_TOLERANCE         
 *\*\          - PB2_5V_TOLERANCE         
 *\*\          - PB3_5V_TOLERANCE        
 *\*\          - PB4_5V_TOLERANCE         
 *\*\          - PB5_5V_TOLERANCE         
 *\*\          - PB7_5V_TOLERANCE         
 *\*\          - PB10_5V_TOLERANCE       
 *\*\          - PB11_5V_TOLERANCE      
 *\*\          - PB12_5V_TOLERANCE        
 *\*\          - PB13_5V_TOLERANCE        
 *\*\          - PB14_5V_TOLERANCE        
 *\*\          - PB15_5V_TOLERANCE
 *\*\return none
 */
void AFIO_5V_Tolerance_Enable(uint32_t tolerance_pin)
{
    AFIO->TOL5V_CFG &= ~tolerance_pin;
}

/**
 *\*\name   AFIO_5V_Tolerance_Disable.
 *\*\fun    Disables 5V tolerance of GPIOA and GPIOB.
 *\*\param  tolerance_pin : 
 *\*\          - PA0_5V_TOLERANCE         
 *\*\          - PA1_5V_TOLERANCE         
 *\*\          - PA2_5V_TOLERANCE        
 *\*\          - PA3_5V_TOLERANCE         
 *\*\          - PA4_5V_TOLERANCE         
 *\*\          - PA5_5V_TOLERANCE         
 *\*\          - PA6_5V_TOLERANCE         
 *\*\          - PA7_5V_TOLERANCE        
 *\*\          - PA8_5V_TOLERANCE         
 *\*\          - PA11_5V_TOLERANCE        
 *\*\          - PA12_5V_TOLERANCE        
 *\*\          - PA15_5V_TOLERANCE        
 *\*\          - PB0_5V_TOLERANCE         
 *\*\          - PB1_5V_TOLERANCE         
 *\*\          - PB2_5V_TOLERANCE         
 *\*\          - PB3_5V_TOLERANCE        
 *\*\          - PB4_5V_TOLERANCE         
 *\*\          - PB5_5V_TOLERANCE         
 *\*\          - PB7_5V_TOLERANCE         
 *\*\          - PB10_5V_TOLERANCE       
 *\*\          - PB11_5V_TOLERANCE      
 *\*\          - PB12_5V_TOLERANCE        
 *\*\          - PB13_5V_TOLERANCE        
 *\*\          - PB14_5V_TOLERANCE        
 *\*\          - PB15_5V_TOLERANCE
 *\*\return none
 */
void AFIO_5V_Tolerance_Disable(uint32_t tolerance_pin)
{
    AFIO->TOL5V_CFG |= tolerance_pin;
}


/**
 *\*\name   AFIO_Filter_Stage_Ctrl.
 *\*\fun    Filtr stage control.
 *\*\param  filter : 
 *\*\          - AFIO_IOFITCFG     filter bypass       
 *\*\return none
 */
void AFIO_Filter_Stage_Ctrl(uint8_t filter)
{
    AFIO->FILT_CFG = (uint32_t)filter;
}


/**
 *\*\name   AFIO_EFT_Enable.
 *\*\fun    Enables EFT IE of port pins.
 *\*\param  GPIOx : 
 *\*\          - GPIOA         
 *\*\          - GPIOB         
 *\*\          - GPIOC         
 *\*\          - GPIOD  
 *\*\param  EFT_pin :       
 *\*\          - AFIO_PA0_EFT                 
 *\*\          - AFIO_PA1_EFT             
 *\*\          - AFIO_PA2_EFT              
 *\*\          - AFIO_PA3_EFT              
 *\*\          - AFIO_PA4_EFT               
 *\*\          - AFIO_PA5_EFT              
 *\*\          - AFIO_PA6_EFT               
 *\*\          - AFIO_PA7_EFT                
 *\*\          - AFIO_PA8_EFT              
 *\*\          - AFIO_PA9_EFT                
 *\*\          - AFIO_PA10_EFT             
 *\*\          - AFIO_PA11_EFT              
 *\*\          - AFIO_PA12_EFT             
 *\*\          - AFIO_PA13_EFT             
 *\*\          - AFIO_PA14_EFT             
 *\*\          - AFIO_PA15_EFT          
 *\*\          - AFIO_PB0_EFT                 
 *\*\          - AFIO_PB1_EFT               
 *\*\          - AFIO_PB2_EFT              
 *\*\          - AFIO_PB3_EFT             
 *\*\          - AFIO_PB4_EFT              
 *\*\          - AFIO_PB5_EFT                
 *\*\          - AFIO_PB6_EFT                
 *\*\          - AFIO_PB7_EFT             
 *\*\          - AFIO_PB8_EFT             
 *\*\          - AFIO_PB9_EFT           
 *\*\          - AFIO_PB10_EFT           
 *\*\          - AFIO_PB11_EFT            
 *\*\          - AFIO_PB12_EFT              
 *\*\          - AFIO_PB13_EFT             
 *\*\          - AFIO_PB14_EFT             
 *\*\          - AFIO_PB15_EFT            
 *\*\          - AFIO_PC13_EFT             
 *\*\          - AFIO_PC14_EFT             
 *\*\          - AFIO_PC15_EFT            
 *\*\          - AFIO_PD0_EFT               
 *\*\          - AFIO_PD12_EFT            
 *\*\          - AFIO_PD13_EFT             
 *\*\          - AFIO_PD14_EFT              
 *\*\          - AFIO_PD15_EFT 
 *\*\return none
 */
void AFIO_EFT_Enable(GPIO_Module* GPIOx, uint32_t EFT_pin)
{
    uint32_t port;

    /* Get port index */
    port = ((uint32_t)GPIO_GET_INDEX(GPIOx));

