SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_gpio.c
    if(!(port & AFIO_EFT_SELECTION_MASK))
    {
        if(GPIOx == GPIOA)
        {
            AFIO->EFT_CFG1 |= EFT_pin;
        }
        else if(GPIOx == GPIOB)
        {
            AFIO->EFT_CFG1 |= EFT_pin;
        }
    }
    else
    {
        if(GPIOx == GPIOC)
        {
            AFIO->EFT_CFG2 |= EFT_pin;
        }
        else if(GPIOx == GPIOD)
        {
            AFIO->EFT_CFG2 |= EFT_pin;
        }
    }     
}


/**
 *\*\name   AFIO_EFT_Disable.
 *\*\fun    Disables EFT IE of port pins.
 *\*\param  GPIOx : 
 *\*\          - GPIOA         
 *\*\          - GPIOB         
 *\*\          - GPIOC         
 *\*\          - GPIOD  
 *\*\param  EFT_pin :       
 *\*\          - AFIO_PA0_EFT                 
 *\*\          - AFIO_PA1_EFT             
 *\*\          - AFIO_PA2_EFT              
 *\*\          - AFIO_PA3_EFT              
 *\*\          - AFIO_PA4_EFT               
 *\*\          - AFIO_PA5_EFT              
 *\*\          - AFIO_PA6_EFT               
 *\*\          - AFIO_PA7_EFT                
 *\*\          - AFIO_PA8_EFT              
 *\*\          - AFIO_PA9_EFT                
 *\*\          - AFIO_PA10_EFT             
 *\*\          - AFIO_PA11_EFT              
 *\*\          - AFIO_PA12_EFT             
 *\*\          - AFIO_PA13_EFT             
 *\*\          - AFIO_PA14_EFT             
 *\*\          - AFIO_PA15_EFT          
 *\*\          - AFIO_PB0_EFT                 
 *\*\          - AFIO_PB1_EFT               
 *\*\          - AFIO_PB2_EFT              
 *\*\          - AFIO_PB3_EFT             
 *\*\          - AFIO_PB4_EFT              
 *\*\          - AFIO_PB5_EFT                
 *\*\          - AFIO_PB6_EFT                
 *\*\          - AFIO_PB7_EFT             
 *\*\          - AFIO_PB8_EFT             
 *\*\          - AFIO_PB9_EFT           
 *\*\          - AFIO_PB10_EFT           
 *\*\          - AFIO_PB11_EFT            
 *\*\          - AFIO_PB12_EFT              
 *\*\          - AFIO_PB13_EFT             
 *\*\          - AFIO_PB14_EFT             
 *\*\          - AFIO_PB15_EFT            
 *\*\          - AFIO_PC13_EFT             
 *\*\          - AFIO_PC14_EFT             
 *\*\          - AFIO_PC15_EFT            
 *\*\          - AFIO_PD0_EFT               
 *\*\          - AFIO_PD12_EFT            
 *\*\          - AFIO_PD13_EFT             
 *\*\          - AFIO_PD14_EFT              
 *\*\          - AFIO_PD15_EFT 
 *\*\return none
 */
void AFIO_EFT_Disable(GPIO_Module* GPIOx, uint32_t EFT_pin)
{
    uint32_t port;

    /* Get port index */
    port = ((uint32_t)GPIO_GET_INDEX(GPIOx));

    if(!(port & AFIO_EFT_SELECTION_MASK))
    {
        if(GPIOx == GPIOA)
        {    
            AFIO->EFT_CFG1 &= ~EFT_pin; 
        }
        else if(GPIOx == GPIOB)
        {
            AFIO->EFT_CFG1 &= ~EFT_pin;
        }
    }
    else
    {
        if(GPIOx == GPIOC)
        {
            AFIO->EFT_CFG2 &= ~EFT_pin; 
        }
        else if(GPIOx == GPIOD)
        {
            AFIO->EFT_CFG2 &= ~EFT_pin;
        }
    }
}



/**
 *\*\name   AFIO_Digital_EFT_Enable.
 *\*\fun    Enables digital EFT IE of port pins.
 *\*\param  GPIOx : 
 *\*\          - GPIOA         
 *\*\          - GPIOB         
 *\*\          - GPIOC         
 *\*\          - GPIOD  
 *\*\param  digital_EFT_pin :       
 *\*\          - AFIO_PA0_DIGEFT                 
 *\*\          - AFIO_PA1_DIGEFT             
 *\*\          - AFIO_PA2_DIGEFT              
 *\*\          - AFIO_PA3_DIGEFT              
 *\*\          - AFIO_PA4_DIGEFT               
 *\*\          - AFIO_PA5_DIGEFT              
 *\*\          - AFIO_PA6_DIGEFT               
 *\*\          - AFIO_PA7_DIGEFT                
 *\*\          - AFIO_PA8_DIGEFT              
 *\*\          - AFIO_PA9_DIGEFT                
 *\*\          - AFIO_PA10_DIGEFT             
 *\*\          - AFIO_PA11_DIGEFT              
 *\*\          - AFIO_PA12_DIGEFT             
 *\*\          - AFIO_PA13_DIGEFT             
 *\*\          - AFIO_PA14_DIGEFT             
 *\*\          - AFIO_PA15_DIGEFT          
 *\*\          - AFIO_PB0_DIGEFT                 
 *\*\          - AFIO_PB1_DIGEFT               
 *\*\          - AFIO_PB2_DIGEFT              
 *\*\          - AFIO_PB3_DIGEFT             
 *\*\          - AFIO_PB4_DIGEFT              
 *\*\          - AFIO_PB5_DIGEFT                
 *\*\          - AFIO_PB6_DIGEFT                
 *\*\          - AFIO_PB7_DIGEFT             
 *\*\          - AFIO_PB8_DIGEFT             
 *\*\          - AFIO_PB9_DIGEFT           
 *\*\          - AFIO_PB10_DIGEFT           
 *\*\          - AFIO_PB11_DIGEFT            
 *\*\          - AFIO_PB12_DIGEFT              
 *\*\          - AFIO_PB13_DIGEFT             
 *\*\          - AFIO_PB14_DIGEFT             
 *\*\          - AFIO_PB15_DIGEFT            
 *\*\          - AFIO_PC13_DIGEFT             
 *\*\          - AFIO_PC14_DIGEFT             
 *\*\          - AFIO_PC15_DIGEFT            
 *\*\          - AFIO_PD0_DIGEFT               
 *\*\          - AFIO_PD12_DIGEFT            
 *\*\          - AFIO_PD13_DIGEFT             
 *\*\          - AFIO_PD14_DIGEFT              
 *\*\          - AFIO_PD15_DIGEFT  
 *\*\return none
 */
void AFIO_Digital_EFT_Enable(GPIO_Module* GPIOx, uint32_t digital_EFT_pin)
{
    uint32_t port;

    /* Get port index */
    port = ((uint32_t)GPIO_GET_INDEX(GPIOx));

    if(!(port & AFIO_EFT_SELECTION_MASK))
    {
        if(GPIOx == GPIOA)
        {
            AFIO->DIGEFT_CFG1 |= digital_EFT_pin;
        }
        else if(GPIOx == GPIOB)
        {
            AFIO->DIGEFT_CFG1 |= digital_EFT_pin;  
        }  
    }
    else
    {
        if(GPIOx == GPIOC)
        {    
            AFIO->DIGEFT_CFG2 |= digital_EFT_pin;
        }
        else if(GPIOx == GPIOD)
        {
            AFIO->DIGEFT_CFG2 |= digital_EFT_pin;
        }
    }     
}


/**
 *\*\name   AFIO_Digital_EFT_Disable.
 *\*\fun    Disables digital EFT IE of port pins.
 *\*\param  GPIOx : 
 *\*\          - GPIOA         
 *\*\          - GPIOB         
 *\*\          - GPIOC         
 *\*\          - GPIOD  
 *\*\param  digital_EFT_pin :       
 *\*\          - AFIO_PA0_DIGEFT                 
 *\*\          - AFIO_PA1_DIGEFT             
 *\*\          - AFIO_PA2_DIGEFT              
 *\*\          - AFIO_PA3_DIGEFT              
 *\*\          - AFIO_PA4_DIGEFT               
 *\*\          - AFIO_PA5_DIGEFT              
 *\*\          - AFIO_PA6_DIGEFT               
 *\*\          - AFIO_PA7_DIGEFT                
 *\*\          - AFIO_PA8_DIGEFT              
 *\*\          - AFIO_PA9_DIGEFT                
 *\*\          - AFIO_PA10_DIGEFT             
 *\*\          - AFIO_PA11_DIGEFT              
 *\*\          - AFIO_PA12_DIGEFT             
 *\*\          - AFIO_PA13_DIGEFT             
 *\*\          - AFIO_PA14_DIGEFT             
 *\*\          - AFIO_PA15_DIGEFT          
 *\*\          - AFIO_PB0_DIGEFT                 
 *\*\          - AFIO_PB1_DIGEFT               
 *\*\          - AFIO_PB2_DIGEFT              
 *\*\          - AFIO_PB3_DIGEFT             
 *\*\          - AFIO_PB4_DIGEFT              
 *\*\          - AFIO_PB5_DIGEFT                
 *\*\          - AFIO_PB6_DIGEFT                
 *\*\          - AFIO_PB7_DIGEFT             
 *\*\          - AFIO_PB8_DIGEFT             
 *\*\          - AFIO_PB9_DIGEFT           
 *\*\          - AFIO_PB10_DIGEFT           
 *\*\          - AFIO_PB11_DIGEFT            
 *\*\          - AFIO_PB12_DIGEFT              
 *\*\          - AFIO_PB13_DIGEFT             
 *\*\          - AFIO_PB14_DIGEFT             
 *\*\          - AFIO_PB15_DIGEFT            
 *\*\          - AFIO_PC13_DIGEFT             
 *\*\          - AFIO_PC14_DIGEFT             
 *\*\          - AFIO_PC15_DIGEFT            
 *\*\          - AFIO_PD0_DIGEFT               
 *\*\          - AFIO_PD12_DIGEFT            
 *\*\          - AFIO_PD13_DIGEFT             
 *\*\          - AFIO_PD14_DIGEFT              
 *\*\          - AFIO_PD15_DIGEFT  
 *\*\return none
 */
void AFIO_Digital_EFT_Disable(GPIO_Module* GPIOx, uint32_t digital_EFT_pin)
{
    uint32_t port;

    /* Get port index */
    port = ((uint32_t)GPIO_GET_INDEX(GPIOx));

    if(!(port & AFIO_EFT_SELECTION_MASK))
    {
        if(GPIOx == GPIOA)
        {
            AFIO->DIGEFT_CFG1 &= ~digital_EFT_pin; 
        }
        else if(GPIOx == GPIOB)
        {
            AFIO->DIGEFT_CFG1 &= ~digital_EFT_pin;
        }
    }
    else
    {
        if(GPIOx == GPIOC)
        {
            AFIO->DIGEFT_CFG2 &= ~digital_EFT_pin; 
        }
        else if(GPIOx == GPIOD)
        {
            AFIO->DIGEFT_CFG2 &= ~digital_EFT_pin;
        }
    }
}

